app/Controllers/Artikel.php

SELECT `artikel`.*, `kategori`.`nama_kategori`
FROM `artikel`
LEFT JOIN `kategori` ON `kategori`.`id_kategori` = `artikel`.`id_kategori`
WHERE   (
`artikel`.`judul` LIKE '%teknologi%' ESCAPE '!'
OR  `kategori`.`nama_kategori` LIKE '%teknologi%' ESCAPE '!'
 )
---
    public function index()
    {
        $keyword = $this->request->getGet('keyword');

        if ($keyword) {
            $artikel = $this->artikelModel->select('artikel.*, kategori.nama_kategori')
                ->join('kategori', 'kategori.id_kategori = artikel.id_kategori', 'left')
                ->groupStart()
                    ->like('artikel.judul', $keyword)
                    ->orLike('kategori.nama_kategori', $keyword)
                ->groupEnd()
                ->findAll();

SELECT *
FROM `kategori`
---
    public function tambah()
    {
        if (session()->get('role') !== 'admin') {
            return redirect()->to('/artikel')->with('error', 'Akses ditolak!');
        }

        $data = [
            'title'    => 'Tambah Artikel Baru',
            'kategori' => $this->kategoriModel->findAll()