app/Controllers/User.php

SELECT *
FROM `user`
WHERE `username` = 'admin'
 LIMIT 1
---
    public function login()
    {
        // Gunakan getMethod() dengan parameter true untuk mendapatkan string uppercase 'POST'
        if ($this->request->getMethod(true) === 'POST') {
            $model = new UserModel();

            // Ambil input dengan helper getPost
            $username = $this->request->getPost('username');
            $password = $this->request->getPost('password');

            // Cari user berdasarkan username/email
            $user = $model->where('username', $username)->first();