app/Models/ArtikelModel.php

SELECT `artikel`.*, `kategori`.`nama_kategori`
FROM `artikel`
JOIN `kategori` ON `kategori`.`id_kategori` = `artikel`.`id_kategori`
---
    public function getArtikelDenganKategori($slug = false)
    {
        if ($slug === false) {
            // Mengambil semua artikel dan join dengan tabel kategori
            return $this->select('artikel.*, kategori.nama_kategori')
                        ->join('kategori', 'kategori.id_kategori = artikel.id_kategori')
                        ->findAll();